BG6UD/uv-k1-k5v3_py32f071_firmware_for_DTrac/App/app/uart.c
    Reply.Header.ID = 0x0515;
    Reply.Header.Size = sizeof(Reply.Data);
    strcpy(Reply.Data.Version, Version);
    Reply.Data.bHasCustomAesKey = bHasCustomAesKey;
    Reply.Data.bIsInLockScreen = bIsInLockScreen;
    Reply.Data.Challenge[0] = gChallenge[0];
    Reply.Data.Challenge[1] = gChallenge[1];
    Reply.Data.Challenge[2] = gChallenge[2];
    Reply.Data.Challenge[3] = gChallenge[3];

    SendReply(Port, &Reply, sizeof(Reply));
}

#ifndef ENABLE_FEAT_F4HWN
static bool IsBadChallenge(const uint32_t *pKey, const uint32_t *pIn, const uint32_t *pResponse)
{
    // PY32 has no AES hardware
    /*
    unsigned int i;
    uint32_t     IV[4];

    IV[0] = 0;
    IV[1] = 0;
    IV[2] = 0;
    IV[3] = 0;

    AES_Encrypt(pKey, IV, pIn, IV, true);

    for (i = 0; i < 4; i++)
        if (IV[i] != pResponse[i])
            return true;
    */

    return false;
}
#endif

// session init, sends back version info and state
// timestamp is a session id really
static void CMD_0514(uint32_t Port, const uint8_t *pBuffer)
{
    const CMD_0514_t *pCmd = (const CMD_0514_t *)pBuffer;

    if (0)
    {
    }
#if defined(ENABLE_UART)
    else if (Port == UART_PORT_UART)
    {
        UART_Timestamp = pCmd->Timestamp;
    }
#endif
#if defined(ENABLE_USB)
    else if (Port == UART_PORT_VCP)
    {
        VCP_Timestamp = pCmd->Timestamp;
    }
#endif

#ifdef ENABLE_FMRADIO
    gFmRadioCountdown_500ms = fm_radio_countdown_500ms;
#endif

    gSerialConfigCountDown_500ms = 12; // 6 sec

    // turn the LCD backlight off
    BACKLIGHT_TurnOff();

    SendVersion(Port);
}

// read eeprom
static void CMD_051B(uint32_t Port, const uint8_t *pBuffer)
{
    const CMD_051B_t *pCmd = (const CMD_051B_t *)pBuffer;
    REPLY_051B_t Reply;
    bool bLocked = false;

    uint32_t Timestamp = 0;

    if (0)
    {
    }
#if defined(ENABLE_UART)
    else if (Port == UART_PORT_UART)
    {
        Timestamp = UART_Timestamp;
    }
#endif
#if defined(ENABLE_USB)
    else if (Port == UART_PORT_VCP)
    {
        Timestamp = VCP_Timestamp;
    }
#endif
    else
    {
        return;
    }

    if (pCmd->Timestamp != Timestamp)
        return;

    gSerialConfigCountDown_500ms = 12; // 6 sec

#ifdef ENABLE_FMRADIO
    gFmRadioCountdown_500ms = fm_radio_countdown_500ms;
#endif

    memset(&Reply, 0, sizeof(Reply));
    Reply.Header.ID = 0x051C;
    Reply.Header.Size = pCmd->Size + 4;
    Reply.Data.Offset = pCmd->Offset;
    Reply.Data.Size = pCmd->Size;

    if (bHasCustomAesKey)
        bLocked = gIsLocked;

    if (!bLocked)
    {
        EEPROM_ReadBuffer(pCmd->Offset, Reply.Data.Data, pCmd->Size);
    }

    SendReply(Port, &Reply, pCmd->Size + 8);
}

// write eeprom
static void CMD_051D(uint32_t Port, const uint8_t *pBuffer)
{
    const CMD_051D_t *pCmd = (const CMD_051D_t *)pBuffer;
    REPLY_051D_t Reply;
    bool bReloadEeprom;
    bool bIsLocked;

    uint32_t Timestamp = 0;

    if (0)
    {
    }
#if defined(ENABLE_UART)
    else if (Port == UART_PORT_UART)
    {
        Timestamp = UART_Timestamp;
    }
#endif
#if defined(ENABLE_USB)
    else if (Port == UART_PORT_VCP)
    {
        Timestamp = VCP_Timestamp;
    }
#endif
    else
    {
        return;
    }

    if (pCmd->Timestamp != Timestamp)
        return;

    gSerialConfigCountDown_500ms = 12; // 6 sec

    bReloadEeprom = false;

#ifdef ENABLE_FMRADIO
    gFmRadioCountdown_500ms = fm_radio_countdown_500ms;
#endif

    Reply.Header.ID = 0x051E;
    Reply.Header.Size = sizeof(Reply.Data);
    Reply.Data.Offset = pCmd->Offset;

    bIsLocked = bHasCustomAesKey ? gIsLocked : false;

    if (!bIsLocked)
    {
        unsigned int i;
        for (i = 0; i < (pCmd->Size / 8); i++)
        {
            const uint16_t Offset = pCmd->Offset + (i * 8U);

            if (Offset >= 0x0F30 && Offset < 0x0F40)
                if (!gIsLocked)
                    bReloadEeprom = true;

            if ((Offset < 0x0E98 || Offset >= 0x0EA0) || !bIsInLockScreen || pCmd->bAllowPassword)
            {
                EEPROM_WriteBuffer(Offset, &pCmd->Data[i * 8U]);
            }
        }

        if (bReloadEeprom)
            SETTINGS_InitEEPROM();
    }

    SendReply(Port, &Reply, sizeof(Reply));
}

#if defined(ENABLE_DTRAC)

// for DTrac app CTCSS_CODE
static void CMD_9999(const uint8_t *pBuffer)
{
    const CMD_9999_t *pCmd = (const CMD_9999_t *)pBuffer;
    uint8_t ctcssCode = pCmd->CTCSS_CODE;
    if (gRxVfo->pTX->Code != ctcssCode)
    {
        if (ctcssCode < 99)
        {
            gRxVfo->pTX->CodeType = CODE_TYPE_CONTINUOUS_TONE;
            gRxVfo->pTX->Code = ctcssCode;
        }
        else
        {
            gRxVfo->pTX->Code = 99; // 修复亚音偶发失步的故障
            gRxVfo->pTX->CodeType = CODE_TYPE_OFF;
        }
        BK4819_SetCTCSSFrequency(CTCSS_Options[ctcssCode]);
    }
}

// for DTrac app downFreq
static void CMD_8888(uint32_t Port, const uint8_t *pBuffer)
{
    const CMD_8888_t *pCmd = (const CMD_8888_t *)pBuffer;
    uint32_t downFrequency = pCmd->DownFrequency / 10;

    if (gRxVfo->pRX->Frequency != downFrequency)
    {
        gRxVfo->pRX->Frequency = downFrequency;

        if (!gPttIsPressed)
        {
            // BK4819_SetAGC(false);
            // SYSTICK_DelayUs(10);

            BK4819_SetFrequency(downFrequency);
            BK4819_PickRXFilterPathBasedOnFrequency(downFrequency);

            uint16_t reg30 = BK4819_ReadRegister(BK4819_REG_30);
            if (gMonitor)
            {
                BK4819_WriteRegister(BK4819_REG_30, reg30 & ~0x8000);
                SYSTICK_DelayUs(100);
                BK4819_WriteRegister(BK4819_REG_30, reg30 | 0x8000);
                SYSTICK_DelayUs(100);
                BK4819_WriteRegister(BK4819_REG_30, reg30);
            }
            else
            {
                // VCO Calibration bit 15 0x8000
                BK4819_WriteRegister(BK4819_REG_30, reg30 | 0x8000);
                SYSTICK_DelayUs(100);
                BK4819_WriteRegister(BK4819_REG_30, reg30);
            }

            BK4819_SetAGC(true);

            SYSTICK_DelayUs(1500);

