BG6UD/uv-k1-k5v3_py32f071_firmware_for_DTrac/App/app/uart.c
    // Limit iterations to prevent long loops when buffer is full of non-command data
    uint16_t maxIterations = ReadBufSize + 1;

    while (maxIterations--)
    {
        if ((*pReadPointer) == DmaLength)
            return false;

        // Find 0xAB with iteration limit
        uint16_t searchLimit = ReadBufSize;
        while ((*pReadPointer) != DmaLength && ReadBuf[*pReadPointer] != 0xABU && searchLimit--)
            *pReadPointer = DMA_INDEX((*pReadPointer), 1, ReadBufSize);

        if (searchLimit == 0)
        {
            // Too many bytes without finding 0xAB - sync to current position and exit
            *pReadPointer = DmaLength;
            return false;
        }

        if ((*pReadPointer) == DmaLength)
            return false;

        if ((*pReadPointer) < DmaLength)
            CommandLength = DmaLength - (*pReadPointer);
        else
            CommandLength = (DmaLength + ReadBufSize) - (*pReadPointer);

        if (CommandLength < 8)
            return 0;

        if (ReadBuf[DMA_INDEX(*pReadPointer, 1, ReadBufSize)] == 0xCD)
            break;

        *pReadPointer = DMA_INDEX(*pReadPointer, 1, ReadBufSize);
    }

    if (maxIterations == 0)
    {
        // Safety: too many outer loop iterations
        *pReadPointer = DmaLength;
        return false;
    }

    Index = DMA_INDEX(*pReadPointer, 2, ReadBufSize);
    Size = (ReadBuf[DMA_INDEX(Index, 1, ReadBufSize)] << 8) | ReadBuf[Index];

    if ((Size + 8u) > ReadBufSize)
    {
        *pReadPointer = DmaLength;
        return false;
    }

    if (CommandLength < (Size + 8))
        return false;

    Index = DMA_INDEX(Index, 2, ReadBufSize);
    TailIndex = DMA_INDEX(Index, Size + 2, ReadBufSize);

    if (ReadBuf[TailIndex] != 0xDC || ReadBuf[DMA_INDEX(TailIndex, 1, ReadBufSize)] != 0xBA)
    {
        *pReadPointer = DmaLength;
        return false;
    }

    if (TailIndex < Index)
    {
        const uint16_t ChunkSize = ReadBufSize - Index;
        memcpy(pUART_Command->Buffer, ReadBuf + Index, ChunkSize);
        memcpy(pUART_Command->Buffer + ChunkSize, ReadBuf, TailIndex);
    }
    else
        memcpy(pUART_Command->Buffer, ReadBuf + Index, TailIndex - Index);

    TailIndex = DMA_INDEX(TailIndex, 2, ReadBufSize);
    if (TailIndex < (*pReadPointer))
    {
        memset(ReadBuf + (*pReadPointer), 0, ReadBufSize - (*pReadPointer));
        memset(ReadBuf, 0, TailIndex);
    }
    else
        memset(ReadBuf + (*pReadPointer), 0, TailIndex - (*pReadPointer));

    *pReadPointer = TailIndex;

    /* --
    if (pUART_Command->Header.ID == 0x0514)
        bIsEncrypted = false;

    if (pUART_Command->Header.ID == 0x6902)
        bIsEncrypted = true;
    -- */

    if (bIsEncrypted)
    {
        unsigned int i;
        for (i = 0; i < (Size + 2u); i++)
            pUART_Command->Buffer[i] ^= Obfuscation[i % 16];
    }

    Crc = pUART_Command->Buffer[Size] | (pUART_Command->Buffer[Size + 1] << 8);

    return CRC_Calculate(pUART_Command->Buffer, Size) == Crc;
}

void UART_HandleCommand(uint32_t Port)
{
    UART_Command_t *pUART_Command;

    if (0)
    {
    }
#if defined(ENABLE_UART)
    else if (Port == UART_PORT_UART)
    {
        pUART_Command = &UART_Command;
    }
#endif
#if defined(ENABLE_USB)
    else if (Port == UART_PORT_VCP)
    {
        pUART_Command = &VCP_Command;
    }
#endif
    else
    {
        return;
    }

    switch (pUART_Command->Header.ID)
    {

#if defined(ENABLE_DTRAC)
    case 0x9999:
        CMD_9999(pUART_Command->Buffer); // for DTrac app TX CTCSS
        break;

    case 0x8888:
        CMD_8888(Port, pUART_Command->Buffer); // for DTrac app downFreq
        break;

    case 0x7777:
        CMD_7777(pUART_Command->Buffer); // for DTrac app upFreq
        break;

    case 0x6666:
        CMD_6666(pUART_Command->Buffer); // for DTrac app mode
        break;

    case 0x5555:
        CMD_5555(pUART_Command->Buffer); // for DTrac app MONITOR
        break;
#endif

    case 0x0514:
        CMD_0514(Port, pUART_Command->Buffer);
        break;

    case 0x051B:
        CMD_051B(Port, pUART_Command->Buffer);
        break;

    case 0x051D:
        CMD_051D(Port, pUART_Command->Buffer);
        break;

    case 0x051F: // Not implementing non-authentic command
        break;

    case 0x0521: // Not implementing non-authentic command
        break;

#ifdef ENABLE_EXTRA_UART_CMD
    case 0x0527:
        CMD_0527(Port);
        break;

    case 0x0529:
        CMD_0529(Port);
        break;

#ifndef ENABLE_FEAT_F4HWN
    case 0x052D:
        CMD_052D(Port, pUART_Command->Buffer);
        break;
#endif

    case 0x052F:
        CMD_052F(Port, pUART_Command->Buffer);
        break;
#endif

    case 0x05DD: // reset
#if defined(ENABLE_OVERLAY)
        overlay_FLASH_RebootToBootloader();
#else
        NVIC_SystemReset();
#endif
        break;

#ifdef ENABLE_UART_RW_BK_REGS
    case 0x0601:
        CMD_0601_ReadBK4819Reg(Port, pUART_Command->Buffer);
        break;

    case 0x0602:
        CMD_0602_WriteBK4819Reg(pUART_Command->Buffer);
        break;
#endif
    } // switch

#ifdef ENABLE_FEAT_F4HWN_SCREENSHOT
    gUART_LockScreenshot = 20; // lock screenshot
#endif
}